SELECT        ТОВАРЫ.Наименование, ЗАКАЗЫ.Дата_поставки
FROM            ЗАКАЗЫ INNER JOIN
                         ТОВАРЫ ON ЗАКАЗЫ.Наименование_товара = ТОВАРЫ.Наименование
WHERE        (ЗАКАЗЫ.Дата_поставки > CONVERT(DATETIME, '2023-10-22 00:00:00', 102))
ORDER BY ТОВАРЫ.Наименование

SELECT        Цена
FROM            ТОВАРЫ
WHERE        (Цена > 12 AND Цена < 33)
ORDER BY Цена DESC

SELECT        Наименование_товара, Заказчик
FROM            ЗАКАЗЫ
WHERE        (Наименование_товара = 'два')
ORDER BY Наименование_товара

SELECT        Номер_заказа, Дата_поставки, Заказчик
FROM            ЗАКАЗЫ
WHERE        (Заказчик = N'фирма3')
ORDER BY Дата_поставки